ippoan/alc-gw-p4/sdkconfig.defaults
# Espressif IoT Development Framework (ESP-IDF) 5.5.3
CONFIG_IDF_TARGET="esp32p4"

# 実機 (rev v1.3) 対応。ESP-IDF v5.5.3 の既定は v3.1+ のみ要求するため必須
# (examples/hello_world/sdkconfig.defaults, docs/hardware-notes.md 参照)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

# Unit PoE-P4: esp32p4 内蔵EMAC + IP101GRI PHY (RMII, 外部クロック GPIO50)。
# GPIO 値は m5stack/M5Unit-PoE-P4-UserDemo の実機 sdkconfig から採取
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_EXAMPLE_USE_INTERNAL_ETHERNET=y
CONFIG_EXAMPLE_ETH_PHY_IP101=y
CONFIG_EXAMPLE_ETH_MDC_GPIO=31
CONFIG_EXAMPLE_ETH_MDIO_GPIO=52
CONFIG_EXAMPLE_ETH_PHY_RST_GPIO=51
CONFIG_EXAMPLE_ETH_PHY_ADDR=1

# esp_peer (WebRTC) は DTLS-SRTP (RFC 5764) 鍵交換に mbedTLS の
# DTLS-SRTP サポートを要求するが、既定では無効 (どちらも default=n)。
# 有効化しないと components/espressif__esp_peer/src/dtls_srtp.c が
# mbedtls_ssl_conf_dtls_srtp_protection_profiles 等の未宣言エラーでビルド失敗する
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y

# signaling_client (wss://) のサーバー証明書検証用。ESP-IDF v5.x は既定で
# y のはずだが明示しておく (ippoan/alc-app#129)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# hub_link (ippoan/alc-app-s3#83 GW側実装): CoreS3 が接続する WS:9000
# サーバーに esp_http_server の WebSocket サポートが要る (既定 n)
CONFIG_HTTPD_WS_SUPPORT=y

# 既定の partitions_singleapp.csv (factory 1MB 固定) は hub_link 追加後に
# 空き 0% まで逼迫したため、実機 flash サイズ (2MB) に合わせて factory app
# を 0x1E0000 (1.875MB) まで拡張したカスタムテーブル (partitions.csv) に切替
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# この基板は PC と native USB Serial/JTAG (espflash/esptool が使うのと同じ
# COM ポート) でしか繋がっておらず、GPIO37/38 (既定の UART0 console) には
# 何も配線されていない。既定のまま (UART0 primary + USB を secondary で
# ログだけミラー) だと、console_cmds.c の対話コンソール (stdin) は誰も
# 繋いでいない UART0 の RX を待ち続け、USB 経由でどんなコマンドを送っても
# 一切応答が返らない事故になる (実機検証で特定、console_cmds.c 側も
# esp_console_new_repl_usb_serial_jtag に合わせて修正済み)。primary console
# 自体も USB Serial/JTAG に切り替え、UART0 との二重駆動を無くす。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
